Repository: eslamene/Election_Attendance_Flutter
Catalog: lib/l10n/app_*.arb
Languages: ar

# appTitle
source: Judges Election Attendance
ar: حضور الجمعية العامة لمحكمة النقض

source: Attendance Modes
ar: أنماط الحضور

source: Scan QR/Barcode
ar: مسح رمز QR/باركود

source: Confirm User
ar: تأكيد المستخدم

source: Settings
ar: الإعدادات

source: Select Attendance Mode
ar: اختر نمط الحضور

source: Start Scan
ar: بدء المسح

source: Confirm
ar: تأكيد

source: Cancel
ar: إلغاء

# apiEndpointConfig
source: API endpoint config here.
ar: إعداد نقطة نهاية API هنا.

# scanError
source: Scan failed or invalid code.
ar: فشل المسح أو رمز غير صالح.

source: User not found.
ar: المستخدم غير موجود.

# attendanceSuccess
source: Attendance confirmed!
ar: تم تأكيد الحضور!

# attendanceFailed
source: Attendance failed. Please try again.
ar: فشل تأكيد الحضور. حاول مرة أخرى.

source: Change Language
ar: تغيير اللغة

# alreadyScanned
source: This user's attendance has already been recorded for this mode.
ar: تم تسجيل حضور هذا المستخدم بالفعل لهذا النمط.

source: Recent Scans
ar: المسحات الأخيرة

source: No scans yet
ar: لم تقم بمسح حتى الآن

# copyright
source: Â© 2025 Elections
ar: © 2025 الانتخابات

source: API Endpoint
ar: نقطة نهاية API

source: Save API Endpoint
ar: حفظ نقطة نهاية API

# currentApiEndpoint
source: Current: {endpoint}
ar: الحالي: {endpoint}

source: Clear History
ar: مسح السجل
